{"data":{"allTestimonialsJson":{"edges":[{"node":{"title":"The Travel Corporation","content":"TTC has a wide and rich set of experiences to distribute to its travel agency partners and want to offer to them all the flexibility available to its own consultants and guests. To achieve this, Featurist have worked extensively with our internal sales experts and with key partners to build an elaborate and yet flexible set of services to support the searching, pricing and booking of experiences, flights and value add across six of TTC’s world’s leading travel brands.","author":{"name":"Patrick Salvi","role":"Senior Business Engagement Manager","link":"https://www.linkedin.com/in/patricksalvi/"},"slug":"/case-studies/ttc/","smallText":true}},{"node":{"title":"7digital","content":"On the technical side Featurist built precisely the right amount we needed and what they did was to an exceptional standard. On the operational side Featurist went above and beyond the call of a typical software team. They had an amazing ability to root out and pursue the issues that needed solving up and down the chain of the organisation to ensure we could deliver on time. We owe a huge amount to Featurist and I would not hesitate in recommending them. We have very high standards at 7digital and Featurist regularly excelled.","author":{"name":"Rob Bowley","role":"Director of Technology","link":"https://www.linkedin.com/in/robertbowley/"},"slug":"/case-studies/7digital/","smallText":true}},{"node":{"title":"Euromoney Institutional Investor PLC","content":"The team we hired from Featurist were dedicated professionals and expert developers. Their commitment to quality and mature approach to Behaviour Driven Development was instrumental in getting a critical project off to a good start and invaluable in maintaining quality over time. Their high standards were also a great help in our recruitment process.","author":{"name":"Ben Jones","role":"CTO","link":"https://www.linkedin.com/in/benjones9/"},"slug":"/case-studies/euromoney/","smallText":true}},{"node":{"title":"Shopa","content":"We have decided to work with Featurist on a number of large projects because they are the very best at what they do. They are able to provide us with a flexible working relationship and they are able to adapt themselves in anyway that ensures the best results occur.","author":{"name":"Peter Janes","role":"CEO","link":"https://www.linkedin.com/in/peterjanes1/"},"slug":"/case-studies/shopa/","smallText":null}},{"node":{"title":"Camden","content":"Featurist were able to rapidly develop a high quality solution for our customer facing council tax services and were instrumental in helping to mature our in house agile development process. I would definitely use Featurist again, and have no hesitation in recommending them.","author":{"name":"Chris Burnett","role":"Solution Architect","link":"https://www.linkedin.com/in/chrisburnett/"},"slug":"/case-studies/camden/","smallText":null}},{"node":{"title":"The Pigeonhole","content":"Featurist have been our key partner taking the Pigeonhole from a design concept, through beta to the full product launch. User feedback on both the technical architecture and the user experience has been excellent - and I could not recommend them enough.","author":{"name":"Jacob Cockroft","role":"CEO","link":"https://www.linkedin.com/in/jacob-cockcroft-3804632/"},"slug":"/case-studies/the-pigeonhole/","smallText":null}}]}}}