{"data":{"images":{"edges":[]},"markdownRemark":{"html":"<p>Euromoney is a world leading publisher of financial market information.</p>\n<p>Euromoney and their subsidiary BCA Research set about building an application that allowed investors to explore the thousands of research documents and charts they produce each year. Part of the solution was to mark-up documents with semantic tags that allowed users to search for and find content related to commonly known entities such as countries, currencies, financial markets.</p>\n<p>This was launched in May 2013 and has since won several awards in innovation and technology, and has been widely successful in the industry.</p>\n<p>Euromoney approached Featurist to help build two components in this product: they needed a fast API for searching and linking documents and chart-data to be served to their CMS and consumer websites. And secondly, they needed a tool to allow editors to markup documents with semantic information so they could be searched and indexed on a well known ontology of countries, currencies, financial markets and instruments.</p>\n<p>Featurist used C# and ASP.Net MVC to build out a central API used to store and index documents and chart data. The API was able to authenticate users from other websites, import content en-masse from other sources in BCA Research and present that information to a consumer website.</p>\n<p>Featurist also built a semantic markup editor that allowed editors to markup an article with semantic tags from an ontology. The editor integrated with an editable text area which was able to switch modes from editing content to highlighting semantic concepts. To minimise regressions we tested the UI through a combination of angular style controller tests and sending UI events as is done in normal human interaction - this technique has since been evolved in the form of Browser Monkey.</p>\n<p>Due to the number of different server components used, we were very conscious of the importance of having automated tests that covered every aspect of the architecture. To make this happen we had setup 20 different environments, each with their own resources, independent enough to be able to run automated tests concurrently for different branches as our work progressed.</p>\n<blockquote>\n<p>The team we hired from Featurist were dedicated professionals and expert developers. Their commitment to quality and mature approach to Behaviour Driven Development was instrumental in getting a critical project off to a good start and invaluable in maintaining quality over time. Their high standards were also a great help in our recruitment process.</p>\n<p><em>Ben Jones, Euromoney / CTO</em></p>\n</blockquote>\n<blockquote>\n<p><a href=\"http://www.euromoneyplc.com/\">www.euromoneyplc.com</a></p>\n</blockquote>","fields":{"slug":"/case-studies/euromoney/"},"frontmatter":{"date":"May 21, 2019","title":"Euromoney","subtitles":["API and semantic markup editor"],"keywords":["Euromoney","API","markup editor"],"hidden":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"absolutePathRegex":"/^/Users/andreipopa/Work/Featurist/featurist-site-2019/src/data/case-studies/euromoney/images/","slug":"/case-studies/euromoney/","prev":{"fileAbsolutePath":"/Users/andreipopa/Work/Featurist/featurist-site-2019/src/data/case-studies/camden/index.md","fields":{"slug":"/case-studies/camden/"},"frontmatter":{"title":"London Borough of Camden"}},"next":{"fileAbsolutePath":"/Users/andreipopa/Work/Featurist/featurist-site-2019/src/data/case-studies/farmdrop/index.md","fields":{"slug":"/case-studies/farmdrop/"},"frontmatter":{"title":"Farmdrop"}}}}